from telebot.types import Message
from utils.utils import get_transport_fact
from config_data.config import DEFAULT_COMMANDS
from loader import bot


@bot.message_handler(state=None)
def reply_to_text(message: Message) -> None:
    """
    Обработчик текстовых сообщений без указанного состояния.
    В ответ на "Привет" также приветствует пользователя; в остальных случаях - выводит текстовое сообщение о том,
    что команда боту не знакома и советует обратиться к справке, а также случайный занимательный факт о транспорте.
    """
    if message.text.lower() == "привет":
        bot.send_message(
            chat_id=message.chat.id,
            text=f"Рад видеть вас, {message.from_user.first_name}!",
        )
        return

    elif message.text.startswith("/") and message.text not in DEFAULT_COMMANDS:
        random_fact = get_transport_fact()
        bot.send_message(
            chat_id=message.chat.id,
            text="Я пока не знаю такую команду 🙄 Список доступных команд можно получить с помощью /help\n\n"
            f"Чтобы реабилитироваться в ваших глазах, приведу занимательный факт о транспорте. Вы знали, что {random_fact}?",
        )
        return

    random_fact = get_transport_fact()
    bot.send_message(
        chat_id=message.chat.id,
        text="Я пока не обучен отвечать на текстовые сообщения пользователя 🥲 Список доступных команд можно получить с помощью /help\n\n"
        f"Чтобы реабилитироваться в ваших глазах, приведу занимательный факт о транспорте. Вы знали, что {random_fact}?",
    )
