import random
from datetime import datetime
from typing import List, Dict

# список из 40 познавательных фактов из истории транспорта
transport_facts = [
    "первый автомобиль Карла Бенца 1886 года был трехколесным",
    "электромобили изобрели раньше бензиновых — в 1828 году",
    "первый кондиционер в авто появился в Packard 1939 года",
    "британцы считают велосипед величайшим изобретением XIX века",
    "первый серийный авто с ABS выпустила Mercedes в 1978 году",
    "лобовое стекло автомобиля изобрели после разбитой колбы химика в 1909 году",
    "в 1900 году создали первый гоночный автомобиль с 35-сильным мотором",
    "во время Второй мировой войны США произвели всего 139 легковых авто",
    "первый подводный поезд — Daddy Long Legs — проехал по морскому дну в 1896 году",
    "Транссиб строили 13 лет без единого выходного",
    "самый длинный поезд в мире составляет 7.35 км и находится он в Австралии",
    "первый пассажирский поезд пошел в 1825 году со скоростью 15 км/ч",
    'в Японии поезда "синкансэн" не опаздывают ни на секунду',
    "рельсы изнашиваются со скоростью 1 мм за 365 лет",
    "первое метро открыли в Лондоне в 1863 году на паровой тяге",
    "самый короткий маршрут метро — это 176 метров, в Греции",
    "братья Райт пролетели 36 метров на первом самолете в 1903 году",
    'самолет "Конкорд" летал вдвое быстрее звука',
    "бортпроводницы появились в 1930 году",
    "в самолете нельзя открыть дверь в полете из-за давления",
    "самый длинный рейс — Сингапур–Нью-Йорк, 19 часов без посадки",
    "аэропорт в аэропорту — Барселона Эль-Прат с музеем внутри",
    "первый контейнеровоз перевез 5 контейнеров в 1956 году",
    'подводная лодка "Наутилус" ходила подо льдом Арктики',
    'корабль "Калипсо" Кусто имел аквариум на борту',
    "венецианские гондолы всегда поворачивают налево",
    "ервый автобус был конным в Париже 1662 года",
    "трамвай изобрели раньше автомобиля",
    "в Сан-Франциско трамваи тянут канатами под землей",
    "в Каире метро строили без остановки движения",
    "в Лиссабоне трамваи маршрута № 28 старше города",
    "самый дорогой велосипед — из золота, стоимостью $1 млн",
    "в Нидерландах больше велосипедов, чем людей",
    "первый электровелосипед создали в 1895 году",
    "в Китае 450 млн велосипедов",
    "скоростной велосипед разгоняется до 333 км/ч",
    "суммарная длина велодорожек в Копенгагене больше протяженности улиц",
    "самый медленный поезд — в Индии, его скорость 8 км/ч",
    "самокат с мотором изобрели в 1915 году",
    'поезд "Восточный Экспресс" шел из Парижа в Стамбул',
]

# словарь соответствия видов транспорта на английском и русском языках
transport_names = {
    "bus": "автобус",
    "plane": "самолёт",
    "train": "поезд",
    "suburban": "электричка",
}


def get_transport_fact() -> str:
    """Выбор одного факта о транспорте случайным образом"""
    return random.choice(transport_facts)


def check_date(text: str) -> bool:
    """Валидирует введенную дату согласно шаблону ДД.ММ.ГГГГ, а также на предмет реального существования даты,
    причем для текущего (2026) года"""
    try:
        text_split = text.split(".")
        if len(text_split) != 3:
            return False

        elif not all(int(element) for element in text_split):
            return False

        day, month, year = map(int, text_split)
        datetime(year, month, day)
        return year == 2026

    except ValueError:
        return False


def convert_date(text: str) -> str:
    """Конвертирует формат даты из привычного ДД.ММ.ГГГГ в требуемый API Яндекс Расписаний формат ГГГГ-ММ-ДД"""
    day, month, year = text.split(".")
    return f"{year}-{month}-{day}"


def get_threads(lst: List[Dict]) -> List[Dict]:
    """Получает на вход список рейсов и возвращает маршруты в виде списка:
    [
    {
     идентификатор_маршрута:
                                {
                                 название_маршрута: строка
                                 номер_маршрута: строка
                                 перевозчик: строка
                                }
    }
    ...
    ]
    """
    threads = []
    thread_numbers_list = []

    for item in lst:
        thread_number = item.get("thread").get("number")
        if thread_number not in thread_numbers_list:
            thread_numbers_list.append(thread_number)

            thread_title = item.get("thread").get("title")
            thread_carrier = item.get("thread").get("carrier").get("title")
            thread_uid = item.get("thread").get("uid")

            threads.append(
                {
                    thread_number: {
                        "title": thread_title,
                        "carrier": thread_carrier,
                        "uid": thread_uid,
                    }
                }
            )

    return threads
